performance/report/statistics.json
{
  "GET /api/products" : {
    "transaction" : "GET /api/products",
    "sampleCount" : 2922,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 151.12251882272406,
    "medianResTime" : 142.0,
    "minResTime" : 46.0,
    "maxResTime" : 506.0,
    "pct1ResTime" : 202.0,
    "pct2ResTime" : 238.0,
    "pct3ResTime" : 336.30999999999995,
    "throughput" : 97.48773896506856,
    "receivedKBytesPerSec" : 675.8102148704668,
    "sentKBytesPerSec" : 14.75644486287659
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 8729,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 62.999541757360475,
    "medianResTime" : 29.0,
    "minResTime" : 3.0,
    "maxResTime" : 506.0,
    "pct1ResTime" : 162.0,
    "pct2ResTime" : 185.0,
    "pct3ResTime" : 264.7000000000007,
    "throughput" : 291.22877256197245,
    "receivedKBytesPerSec" : 978.491807991776,
    "sentKBytesPerSec" : 45.97526445676109
  },
  "GET /api/categories" : {
    "transaction" : "GET /api/categories",
    "sampleCount" : 2902,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 5.508270158511369,
    "medianResTime" : 5.0,
    "minResTime" : 3.0,
    "maxResTime" : 37.0,
    "pct1ResTime" : 7.0,
    "pct2ResTime" : 9.0,
    "pct3ResTime" : 12.0,
    "throughput" : 97.5560560728813,
    "receivedKBytesPerSec" : 153.36499268833833,
    "sentKBytesPerSec" : 14.957325003361683
  },
  "GET /api/products/search?keyword=ao" : {
    "transaction" : "GET /api/products/search?keyword=ao",
    "sampleCount" : 2905,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 31.792771084337286,
    "medianResTime" : 29.0,
    "minResTime" : 11.0,
    "maxResTime" : 190.0,
    "pct1ResTime" : 46.0,
    "pct2ResTime" : 53.0,
    "pct3ResTime" : 82.0,
    "throughput" : 97.42110734766423,
    "receivedKBytesPerSec" : 151.25010741892754,
    "sentKBytesPerSec" : 16.458839424947183
  }
}